package com.javarush.test.level00.lesson03.task01;

/* Лила самая красивая
Написать программу, выводящую на экран надпись «Лила самая красивая» 5 раз. Каждый раз – с новой строки.
*/
public class Solution
{
    public static void main(String[] args)
    {
        //напишите тут ваш код
        System.out.println("Лила самая красивая");
        System.out.println("Лила самая красивая");
        System.out.println("Лила самая красивая");
        System.out.println("Лила самая красивая");
        System.out.println("Лила самая красивая");
    }
}
